app/controllers/observations_controller.rb

    gon.timearray2 = @timearray2
    gon.timearray3 = @timearray3

    @observations = Observation.all
---
SELECT "observations".* FROM "observations"

  def create
    @observation = Observation.new(observation_params)
      if @observation.save
---
INSERT INTO "observations" ("created_at", "description", "photo", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 01 Dec 2013 05:57:48 UTC +00:00], ["description", "Rogers Pass Observations"], ["photo", "avalanchenotebook.jpg"], ["updated_at", Sun, 01 Dec 2013 05:57:48 UTC +00:00]]