app/controllers/users_controller.rb

  def create
   @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 15 Nov 2013 04:24:21 UTC +00:00], ["email", "delbegio@gmail.com"], ["name", "caleb"], ["phone", "6047203860"], ["updated_at", Fri, 15 Nov 2013 04:24:21 UTC +00:00]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "45"]]
UPDATE "users" SET "email" = $1, "phone" = $2, "updated_at" = $3 WHERE "users"."id" = 45  [["email", "delbegio@gmail.com"], ["phone", "604-720-3860"], ["updated_at", Sat, 30 Nov 2013 22:44:49 UTC +00:00]]